## imbalance 한 데이터셋 구조 변경

In [1]:
import pandas as pd

In [2]:
data_df = pd.read_csv('../../datasets/titanic_disaster_train.csv')
data_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data_df.dropna(inplace=True)
data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

In [11]:
numeric_df = data_df.select_dtypes(exclude=['object'])
features = numeric_df.drop(columns=['Survived'])
label = data_df['Survived']
features.columns

Index(['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

### 언더샘플링
- 데이터 삭제

In [12]:
from imblearn.under_sampling import TomekLinks


tomeklinks = TomekLinks()
feature_tomek, label_tomek = tomeklinks.fit_resample(X=features, y=label)

In [13]:
len(features), len(feature_tomek), len(label), len(label_tomek)

(183, 164, 183, 164)

In [15]:
label.value_counts(), label_tomek.value_counts()

(Survived
 1    123
 0     60
 Name: count, dtype: int64,
 Survived
 1    104
 0     60
 Name: count, dtype: int64)

### 오버샘플링
- 데이터 생성 (많이 하면 않좋음.)

In [16]:
from imblearn.over_sampling import SMOTE

smote = SMOTE()
feature_smote, label_smote = smote.fit_resample(X=features, y=label)

In [18]:
len(features), len(feature_smote), len(label), len(label_smote)

(183, 246, 183, 246)

In [19]:
label.value_counts(), label_smote.value_counts()

(Survived
 1    123
 0     60
 Name: count, dtype: int64,
 Survived
 1    123
 0    123
 Name: count, dtype: int64)